Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
/********************************************************************
**版权所有：       深圳市几米物联有限公司
**文件名称：       uart_driver.c
**文件描述：       UART驱动模块实现文件
**当前版本：       V1.3
**作    者：       Harrison Wu (wuyujiao@jimiiot.com)
**完成日期：       2026.04.22
**修改日期：       2026.05.20
*********************************************************************
** 功能描述：       1. 实现多UART独立管理和状态机控制
**                 2. 实现注册/卸载/收发/电源管理功能
**                 3. 支持5种TX模式（轮询/中断/DMA同步/DMA异步/DMA双缓冲）
**                 4. 支持DMA接收、IDLE空闲中断、RingBuffer（含半满中断通知防溢出）
**                 5. 支持低功耗挂起/恢复、线程安全
**                 6. 驱动层与应用层完全解耦，内存由应用层管理
**                 7. 每个UART端口可独立配置运行时TX模式
**                 8. 支持GPIO配置宏表，编译期选择引脚，NO_USE节省代码空间
*********************************************************************/

#include "uart_driver.h"
#include "dma_driver.h"
#include "gpio_driver.h"
#include "gd32f50x_usart.h"
#include <string.h>

/*********************************************************************
 * 内部数据结构定义
 *********************************************************************/

/**
 * @brief UART现场保存结构体（用于suspend/resume）
 */
typedef struct {
    uint32_t baudrate;          /**< 波特率 */
    uint32_t stat;              /**< STAT寄存器 */
    uint32_t ctrl0;             /**< CTRL0寄存器 */
    uint32_t ctrl1;             /**< CTRL1寄存器 */
    uint32_t ctrl2;             /**< CTRL2寄存器 */
} drv_uart_context_t;

/**
 * @brief TX中断控制结构（仅INTERRUPT模式使用）
 */
typedef struct {
    uint8_t      *tx_buf;           /**< TX缓冲区指针 */
    uint16_t      tx_buf_size;      /**< 缓冲区大小 */
    uint16_t      tx_write_idx;     /**< 写指针 */
    uint16_t      tx_read_idx;      /**< 读指针 */
    uint16_t      tx_count;         /**< 缓冲区中数据量 */
    uint16_t      tx_total_len;     /**< 本次发送总长度 */
    bool          tx_active;        /**< 是否正在发送 */
} drv_uart_tx_irq_ctrl_t;

/**
 * @brief UART控制结构体（驱动内部维护）
 */
typedef struct {
    drv_uart_config_t   config;             /**< 应用层配置（只读） */
    drv_uart_state_e    state;              /**< 当前状态 */
    drv_uart_tx_mode_e  tx_mode;            /**< 发送模式 */
    SemaphoreHandle_t tx_mutex;             /**< 发送互斥锁 */
    SemaphoreHandle_t tx_sem;               /**< DMA发送完成信号量（仅异步模式） */
    drv_uart_ring_tx_ctrl_t *ring_tx_ctrl;  /**< 双缓冲控制（仅DUAL_BUF模式） */
    drv_uart_tx_irq_ctrl_t *tx_irq_ctrl;    /**< 中断发送控制（仅INTERRUPT模式） */
    drv_uart_context_t  context;            /**< 挂起现场 */
    uint16_t        dma_rx_len;             /**< DMA接收数据长度 */
    uint16_t        rx_write_index;         /**< rx_buf写指针（中断使用） */
    uint16_t        rx_read_index;          /**< rx_buf读指针（应用层使用） */
    uint8_t         rx_mode;                /**< 接收模式 */
    uint8_t         irq_enabled;            /**< 中断使能标志 */
    volatile bool  ringbuf_half_triggered;  /**< RingBuffer半满回调已触发标志（防止重复触发，中断和任务共享需临界区保护） */
    volatile uint16_t dma_rx_last_pos;      /**< DMA RX 上次拷贝位置（用于 HTF/FTF 增量计算，仅 CIRCULAR 模式使用） */
    volatile bool   dma_tx_active;          /**< DMA 异步发送进行中标志（ISR 回调定位用） */
    uint16_t        dma_tx_len;             /**< 本次 DMA 异步发送长度（ISR 回调传递给应用层） */
} drv_uart_ctrl_t;

/*********************************************************************
 * 内部全局变量
 *********************************************************************/

/** UART控制实例数组 */
static drv_uart_ctrl_t s_uart_ctrl[DRV_UART_PORT_MAX] = {0};

/** USART基地址映射表 */
static uint32_t const s_usart_base[DRV_UART_PORT_MAX] = {
    USART0,
    USART1,
    USART2,
    UART3,
    UART4
};

/**
 * @brief USART NVIC 配置结构体
 */
typedef struct {
    IRQn_Type irqn;              /**< NVIC 中断号 */
    uint8_t preempt_priority;    /**< 抢占优先级（0-15，数值越小优先级越高） */
    uint8_t sub_priority;        /**< 子优先级（0-15，数值越小优先级越高） */
} drv_uart_nvic_config_t;

/**
 * @brief USART NVIC 配置表
 * @note  配置说明：
 *        - irqn: NVIC 中断号，由芯片硬件决定，不可修改
 *        - preempt_priority: 抢占优先级，开发人员可根据实际需求修改
 *        - sub_priority: 子优先级，开发人员可根据实际需求修改
 *        - 建议：高速通信端口使用高优先级（数值小），低速端口使用低优先级（数值大）
 *        - 默认配置：所有端口统一使用优先级 3，子优先级 0
 */
static const drv_uart_nvic_config_t s_usart_nvic_config[DRV_UART_PORT_MAX] = {
    {USART0_IRQn, 3, 0},  /* USART0: IRQ37, 抢占优先级3, 子优先级0 */
    {USART1_IRQn, 3, 0},  /* USART1: IRQ38, 抢占优先级3, 子优先级0 */
    {USART2_IRQn, 3, 0},  /* USART2: IRQ39, 抢占优先级3, 子优先级0 */
    {UART3_IRQn,  3, 0},  /* UART3:  IRQ40, 抢占优先级3, 子优先级0 */
    {UART4_IRQn,  3, 0}   /* UART4:  IRQ41, 抢占优先级3, 子优先级0 */
};

/** UART RX DMA通道映射表（UART4无DMA） */
static drv_dma_channel_id_e const s_uart_rx_dma_ch[DRV_UART_PORT_MAX] = {
    DRV_DMA0_CH1,  /* USART0_RX -> DMA0_CH1 */
    DRV_DMA0_CH2,  /* USART1_RX -> DMA0_CH2 */
    DRV_DMA0_CH3,  /* USART2_RX -> DMA0_CH3 */
    DRV_DMA0_CH4,  /* UART3_RX  -> DMA0_CH4 */
    DRV_DMA_MAX    /* UART4     -> 无DMA */
};

/** UART TX DMA通道映射表（UART4无DMA） */
static drv_dma_channel_id_e const s_uart_tx_dma_ch[DRV_UART_PORT_MAX] = {
    DRV_DMA0_CH5,  /* USART0_TX -> DMA0_CH5（避开CH0，ADC专用） */
    DRV_DMA0_CH6,  /* USART1_TX -> DMA0_CH6 */
    DRV_DMA1_CH1,  /* USART2_TX -> DMA1_CH1 */
    DRV_DMA1_CH4,  /* UART3_TX  -> DMA1_CH4 */
    DRV_DMA_MAX    /* UART4     -> 无DMA */
};

/** UART DMA请求源映射表 */
static uint32_t const s_uart_dma_request[DRV_UART_PORT_MAX][2] = {
    {DMA_REQUEST_USART0_RX, DMA_REQUEST_USART0_TX},
    {DMA_REQUEST_USART1_RX, DMA_REQUEST_USART1_TX},
    {DMA_REQUEST_USART2_RX, DMA_REQUEST_USART2_TX},
    {DMA_REQUEST_UART3_RX,  DMA_REQUEST_UART3_TX},
    {0, 0}  /* UART4无DMA */
};

/*********************************************************************
 * 内部辅助函数声明
 *********************************************************************/

static int _drv_uart_check_param(const drv_uart_config_t *config);
static int _drv_uart_hw_init(drv_uart_port_e port);
static int _drv_uart_hw_deinit(drv_uart_port_e port);
static int _drv_uart_enable_interrupt(drv_uart_port_e port);
static int _drv_uart_disable_interrupt(drv_uart_port_e port);
static int _drv_uart_enable_dma_rx(drv_uart_port_e port);
static int _drv_uart_disable_dma_rx(drv_uart_port_e port);

