Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
static void uart_dma_tx_isr_callback(drv_dma_channel_id_e channel_id);
static void uart_dma_rx_htf_callback(drv_dma_channel_id_e channel_id);
static void uart_dma_rx_ftf_callback(drv_dma_channel_id_e channel_id);

static int32_t _uart_ring_queue_push(drv_uart_port_e port, const uint8_t *data, uint16_t len);
static uint16_t _uart_ring_queue_pop(drv_uart_port_e port, uint8_t *data, uint16_t max_len);
static uint16_t _uart_ring_queue_pop_isr(drv_uart_ring_tx_ctrl_t *ring_ctrl, uint8_t *data, uint16_t max_len);
static void uart_dma_ring_tx_ftf_callback(drv_dma_channel_id_e channel_id);
static int32_t _uart_send_ring_start(drv_uart_port_e port);

/*********************************************************************
 * 内部辅助函数实现
 *********************************************************************/

/*********************************************************************
 * @brief   根据 RX DMA 通道号反查 UART 端口
 * @param   channel_id  DMA 通道 ID
 * @return  UART 端口号，未找到返回 DRV_UART_PORT_MAX
 *********************************************************************/
static drv_uart_port_e _uart_find_port_by_rx_dma_ch(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e i;

    for (i = 0; i < DRV_UART_PORT_MAX; i++)
    {
        if (s_uart_rx_dma_ch[i] == channel_id)
        {
            return i;
        }
    }

    return DRV_UART_PORT_MAX;
}

/*********************************************************************
 * @brief   根据 TX DMA 通道号反查 UART 端口
 * @param   channel_id  DMA 通道 ID
 * @return  UART 端口号，未找到返回 DRV_UART_PORT_MAX
 *********************************************************************/
static drv_uart_port_e _uart_find_port_by_tx_dma_ch(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e i;

    for (i = 0; i < DRV_UART_PORT_MAX; i++)
    {
        if (s_uart_tx_dma_ch[i] == channel_id)
        {
            return i;
        }
    }

    return DRV_UART_PORT_MAX;
}

/*********************************************************************
 * @brief   检查配置参数合法性
 * @param   config  配置结构体指针
 * @return  0表示合法，-1表示非法
 *********************************************************************/
static int _drv_uart_check_param(const drv_uart_config_t *config)
{
    if (config == NULL)
    {
        DRV_UART_LOGE("Invalid UART config parameter");
        return DRV_UART_ERR_FAILED;
    }

    if (config->port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", config->port);
        return DRV_UART_ERR_FAILED;
    }

    /* 接收缓冲区校验：使用 RingBuffer 时 rx_buf 可选，否则必须提供 */
    if (config->use_ringbuf == false)
    {
        if (config->rx_buf == NULL || config->rx_buf_size == 0)
        {
            DRV_UART_LOGE("Invalid UART RX buffer (RingBuffer not enabled)");
            return DRV_UART_ERR_FAILED;
        }
    }
    else
    {
        /* RingBuffer 模式：ringbuf 指针必须有效 */
        if (config->ringbuf == NULL)
        {
            DRV_UART_LOGE("Invalid RingBuffer pointer");
            return DRV_UART_ERR_FAILED;
        }
    }

    if (config->use_dma_rx == true)
    {
        if (config->dma_rx_buf == NULL || config->dma_rx_buf_size == 0)
        {
            DRV_UART_LOGE("Invalid DMA RX buffer");
            return DRV_UART_ERR_FAILED;
        }
    }

    return 0;
}

/*********************************************************************
 * @brief   UART硬件初始化
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    配置波特率、数据位、停止位、校验位等
 *********************************************************************/
static int _drv_uart_hw_init(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    drv_gpio_config_t gpio_cfg = {0};

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    DRV_UART_LOGD("Hardware init UART port %d, baudrate=%d", port, ctrl->config.baudrate);

    /* 使能UART时钟和GPIO时钟（根据端口配置） */
    rcu_periph_clock_enable(RCU_AF);  /* 使能复用功能时钟（必须） */

    switch (port)
    {
        case DRV_UART_PORT_USART0:
#if DRV_USART0_GPIO_SEL == DRV_USART0_GPIO_PA9_PA10
            rcu_periph_clock_enable(RCU_USART0);  /* 使能USART0外设时钟 */

            /* USART0: PA9(TX), PA10(RX) - GD32F50x USART0使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_A;
            gpio_cfg.pin = DRV_GPIO_PIN_9 | DRV_GPIO_PIN_10;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#elif DRV_USART0_GPIO_SEL == DRV_USART0_GPIO_PB6_PB7
            rcu_periph_clock_enable(RCU_USART0);  /* 使能USART0外设时钟 */

            /* USART0: PB6(TX), PB7(RX) - GD32F50x USART0使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_B;
            gpio_cfg.pin = DRV_GPIO_PIN_6 | DRV_GPIO_PIN_7;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#endif
            break;

        case DRV_UART_PORT_USART1:
#if DRV_USART1_GPIO_SEL == DRV_USART1_GPIO_PA2_PA3
            rcu_periph_clock_enable(RCU_USART1);  /* 使能USART1外设时钟 */

            /* USART1: PA2(TX), PA3(RX) - GD32F50x USART1使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_A;
            gpio_cfg.pin = DRV_GPIO_PIN_2 | DRV_GPIO_PIN_3;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#elif DRV_USART1_GPIO_SEL == DRV_USART1_GPIO_PD5_PD6
            rcu_periph_clock_enable(RCU_USART1);  /* 使能USART1外设时钟 */

            /* USART1: PD5(TX), PD6(RX) - GD32F50x USART1使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_D;
            gpio_cfg.pin = DRV_GPIO_PIN_5 | DRV_GPIO_PIN_6;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#endif
            break;

