Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
        case DRV_UART_PORT_USART2:
#if DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PB10_PB11
            rcu_periph_clock_enable(RCU_USART2);  /* 使能USART2外设时钟 */

            /* UART2: PB10(TX), PB11(RX) - GD32F50x UART2使用AF_1 */
            gpio_cfg.port = DRV_GPIO_PORT_B;
            gpio_cfg.pin = DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11;
            gpio_cfg.af = DRV_GPIO_AF_1;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#elif DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PC10_PC11
            rcu_periph_clock_enable(RCU_USART2);  /* 使能USART2外设时钟 */

            /* UART2: PC10(TX), PC11(RX) - GD32F50x UART2使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_C;
            gpio_cfg.pin = DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#elif DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PD8_PD9
            rcu_periph_clock_enable(RCU_USART2);  /* 使能USART2外设时钟 */

            /* UART2: PD8(TX), PD9(RX) - GD32F50x UART2使用AF_0 */
            gpio_cfg.port = DRV_GPIO_PORT_D;
            gpio_cfg.pin = DRV_GPIO_PIN_8 | DRV_GPIO_PIN_9;
            gpio_cfg.af = DRV_GPIO_AF_0;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#endif
            break;

        case DRV_UART_PORT_UART3:
#if DRV_UART3_GPIO_SEL == DRV_UART3_GPIO_PC10_PC11
            rcu_periph_clock_enable(RCU_UART3);   /* 使能UART3外设时钟 */

            /* UART3: PC10(TX), PC11(RX) - GD32F50x UART3使用AF_1 */
            gpio_cfg.port = DRV_GPIO_PORT_C;
            gpio_cfg.pin = DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11;
            gpio_cfg.af = DRV_GPIO_AF_1;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#endif
            break;

        case DRV_UART_PORT_UART4:
#if DRV_UART4_GPIO_SEL == DRV_UART4_GPIO_PC12_PD2
            rcu_periph_clock_enable(RCU_UART4);   /* 使能UART4外设时钟 */

            /* UART4: PC12(TX) - GD32F50x UART4使用AF_1 */
            gpio_cfg.port = DRV_GPIO_PORT_C;
            gpio_cfg.pin = DRV_GPIO_PIN_12;
            gpio_cfg.af = DRV_GPIO_AF_1;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);

            /* UART4: PD2(RX) - GD32F50x UART4使用AF_1 */
            gpio_cfg.port = DRV_GPIO_PORT_D;
            gpio_cfg.pin = DRV_GPIO_PIN_2;
            gpio_cfg.af = DRV_GPIO_AF_1;
            gpio_cfg.mode = DRV_GPIO_MODE_AF;
            gpio_cfg.otype = DRV_GPIO_OTYPE_PP;
            gpio_cfg.speed = DRV_GPIO_SPEED_LEVEL3;
            gpio_cfg.pupd = DRV_GPIO_PUPD_PULLUP;
            drv_gpio_init(&gpio_cfg);
#endif
            break;

        default:
            break;
    }

    /* 配置UART参数 */
    usart_deinit(usart_base);
    usart_baudrate_set(usart_base, ctrl->config.baudrate);
    usart_word_length_set(usart_base, USART_WL_8BIT);
    usart_stop_bit_set(usart_base, USART_STB_1BIT);
    usart_parity_config(usart_base, USART_PM_NONE);
    usart_hardware_flow_rts_config(usart_base, USART_RTS_DISABLE);
    usart_hardware_flow_cts_config(usart_base, USART_CTS_DISABLE);
    usart_receive_config(usart_base, USART_RECEIVE_ENABLE);
    usart_transmit_config(usart_base, USART_TRANSMIT_ENABLE);
    usart_enable(usart_base);

    DRV_UART_LOGD("UART port %d hardware initialized", port);

    return 0;
}

/*********************************************************************
 * @brief   UART硬件去初始化
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    关闭UART外设、GPIO时钟，复位GPIO引脚
 *********************************************************************/
static int _drv_uart_hw_deinit(drv_uart_port_e port)
{
    uint32_t usart_base;

    if (port >= DRV_UART_PORT_MAX)
    {
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];

    /* 关闭UART外设 */
    usart_disable(usart_base);

    /* 关闭UART外设时钟并反初始化GPIO引脚 */
    switch (port)
    {
        case DRV_UART_PORT_USART0:
            rcu_periph_clock_disable(RCU_USART0);
#if DRV_USART0_GPIO_SEL == DRV_USART0_GPIO_PA9_PA10
            drv_gpio_deinit(DRV_GPIO_PORT_A, DRV_GPIO_PIN_9 | DRV_GPIO_PIN_10);
#elif DRV_USART0_GPIO_SEL == DRV_USART0_GPIO_PB6_PB7
            drv_gpio_deinit(DRV_GPIO_PORT_B, DRV_GPIO_PIN_6 | DRV_GPIO_PIN_7);
#endif
            break;

        case DRV_UART_PORT_USART1:
            rcu_periph_clock_disable(RCU_USART1);
#if DRV_USART1_GPIO_SEL == DRV_USART1_GPIO_PA2_PA3
            drv_gpio_deinit(DRV_GPIO_PORT_A, DRV_GPIO_PIN_2 | DRV_GPIO_PIN_3);
#elif DRV_USART1_GPIO_SEL == DRV_USART1_GPIO_PB13_PB14
            drv_gpio_deinit(DRV_GPIO_PORT_B, DRV_GPIO_PIN_13 | DRV_GPIO_PIN_14);
#endif
            break;

        case DRV_UART_PORT_USART2:
            rcu_periph_clock_disable(RCU_USART2);
#if DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PB10_PB11
            drv_gpio_deinit(DRV_GPIO_PORT_B, DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11);
#elif DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PC10_PC11
            drv_gpio_deinit(DRV_GPIO_PORT_C, DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11);
#elif DRV_UART2_GPIO_SEL == DRV_UART2_GPIO_PD8_PD9
            drv_gpio_deinit(DRV_GPIO_PORT_D, DRV_GPIO_PIN_8 | DRV_GPIO_PIN_9);
#endif
            break;

        case DRV_UART_PORT_UART3:
            rcu_periph_clock_disable(RCU_UART3);
#if DRV_UART3_GPIO_SEL == DRV_UART3_GPIO_PC10_PC11
            drv_gpio_deinit(DRV_GPIO_PORT_C, DRV_GPIO_PIN_10 | DRV_GPIO_PIN_11);
#endif
            break;

        case DRV_UART_PORT_UART4:
            rcu_periph_clock_disable(RCU_UART4);
#if DRV_UART4_GPIO_SEL == DRV_UART4_GPIO_PC12_PD2
            drv_gpio_deinit(DRV_GPIO_PORT_C, DRV_GPIO_PIN_12);
            drv_gpio_deinit(DRV_GPIO_PORT_D, DRV_GPIO_PIN_2);
#endif
            break;

        default:
            break;
    }

