Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    return 0;
}

/*********************************************************************
 * @brief   使能UART中断
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    使能RXNE中断，如果配置了IDLE则使能IDLE中断
 *********************************************************************/
static int _drv_uart_enable_interrupt(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    uint32_t timeout = 10000U;

    if (port >= DRV_UART_PORT_MAX)
    {
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    /* 清除残留的IDLEF标志（防止上电/软复位后残留的IDLEF触发中断）
     * 注：GD32F50x IDLEF清除方式：读STAT0 + 读DATA（参考官方IDLE_receive_interrupt示例）
     * 等待IDLEF置位后再清除，带超时保护防止死循环 */
    while ((RESET == usart_flag_get(usart_base, USART_FLAG_IDLE)) && (timeout > 0U))
    {
        timeout--;
    }
    (void)USART_STAT0(usart_base);         /* 读STAT0 */
    (void)usart_data_receive(usart_base);  /* 读DATA，清除IDLEF */

    /* 使能接收中断 */
    usart_interrupt_enable(usart_base, USART_INT_RBNE);

    /* 如果启用IDLE中断，使能IDLE中断 */
    if (ctrl->config.use_idle == true)
    {
        usart_interrupt_enable(usart_base, USART_INT_IDLE);
    }

    /* 使能错误中断（ERRIE 仅在 DMA 接收使能时有效，参考手册 ERRIE 描述） */
    if (ctrl->config.use_dma_rx == true)
    {
        usart_interrupt_enable(usart_base, USART_INT_ERR);
    }

    /* 使能 NVIC 中断控制器（必须！） */
    nvic_irq_enable(s_usart_nvic_config[port].irqn,
                    s_usart_nvic_config[port].preempt_priority,
                    s_usart_nvic_config[port].sub_priority);

    DRV_UART_LOGD("UART port %d interrupts enabled, IDLE=%d, NVIC=IRQ%d (Prio=%d,%d)",
                  port, ctrl->config.use_idle, s_usart_nvic_config[port].irqn,
                  s_usart_nvic_config[port].preempt_priority,
                  s_usart_nvic_config[port].sub_priority);

    return 0;
}

/*********************************************************************
 * @brief   禁能UART中断
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    无
 *********************************************************************/
static int _drv_uart_disable_interrupt(drv_uart_port_e port)
{
    uint32_t usart_base;
    uint32_t timeout = 10000U;

    if (port >= DRV_UART_PORT_MAX)
    {
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];

    usart_interrupt_disable(usart_base, USART_INT_RBNE);
    usart_interrupt_disable(usart_base, USART_INT_IDLE);
    usart_interrupt_disable(usart_base, USART_INT_ERR);

    /* 清除残留的IDLEF标志（防止关闭中断期间残留，下次使能时误触发） */
    while ((RESET == usart_flag_get(usart_base, USART_FLAG_IDLE)) && (timeout > 0U))
    {
        timeout--;
    }
    (void)USART_STAT0(usart_base);        /* 读STAT0 */
    (void)usart_data_receive(usart_base);  /* 读DATA，清除IDLEF */

    /* 禁用 NVIC 中断控制器 */
    nvic_irq_disable(s_usart_nvic_config[port].irqn);

    DRV_UART_LOGD("UART port %d interrupts disabled", port);

    return 0;
}

/*********************************************************************
 * @brief   使能DMA接收
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    配置DMA通道并启动DMA接收
 *********************************************************************/
static int _drv_uart_enable_dma_rx(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    drv_dma_channel_id_e dma_ch;
    drv_dma_config_t dma_config;
    uint32_t dma_request;

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];
    dma_ch = s_uart_rx_dma_ch[port];

    /* 检查是否支持DMA（UART4无DMA） */
    if (dma_ch >= DRV_DMA_MAX)
    {
        DRV_UART_LOGE("Port %d does not support DMA RX", port);
        return DRV_UART_ERR_FAILED;
    }

    /* 获取DMA请求源 */
    dma_request = s_uart_dma_request[port][0];  /* [0]=RX, [1]=TX */

    DRV_UART_LOGD("Enable DMA RX for port %d, channel=%d, request=0x%02X",
                  port, dma_ch, dma_request);

    /* 配置DMA参数 */
    dma_config.request_id = dma_request;
    dma_config.periph_addr = usart_base + 0x04U;  /* USART_DATA寄存器偏移 */
    dma_config.memory_addr = (uint32_t)ctrl->config.dma_rx_buf;
    dma_config.periph_width = DRV_DMA_WIDTH_8BIT;
    dma_config.memory_width = DRV_DMA_WIDTH_8BIT;
    dma_config.transfer_number = ctrl->config.dma_rx_buf_size;
    dma_config.direction = DRV_DMA_DIR_PERIPH_TO_MEMORY;
    dma_config.priority = DRV_DMA_PRIORITY_HIGH;
    dma_config.mode = DRV_DMA_MODE_CIRCULAR;  /* CIRCULAR：HTF+FTF+IDLE 三合一接收 */
    dma_config.periph_inc = false;
    dma_config.memory_inc = true;

    /* 初始化DMA通道 */
    if (drv_dma_init(dma_ch, &dma_config) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA init failed for port %d", port);
        return DRV_UART_ERR_FAILED;
    }

    /* 注册 HTF/FTF 回调 */
    if (drv_dma_callback_register(dma_ch, DRV_DMA_INT_HTF, uart_dma_rx_htf_callback) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA HTF callback register failed for port %d", port);
        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_FAILED;
    }
    if (drv_dma_callback_register(dma_ch, DRV_DMA_INT_FTF, uart_dma_rx_ftf_callback) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA FTF callback register failed for port %d", port);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_HTF);
        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_FAILED;
    }

    /* 使能 HTF + FTF 中断 */
    if (drv_dma_int_enable(dma_ch, DRV_DMA_INT_HTF | DRV_DMA_INT_FTF, 3) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA interrupt enable failed for port %d", port);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_HTF);
        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_FAILED;
    }

    /* 使能UART DMA接收请求 */
    usart_dma_receive_config(usart_base, USART_DENR_ENABLE);

