Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    /* 初始化 DMA RX 位置跟踪 */
    ctrl->dma_rx_last_pos = 0U;

    /* 启动DMA传输 */
    if (drv_dma_start(dma_ch) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA start failed for port %d", port);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_HTF | DRV_DMA_INT_FTF);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_HTF);
        usart_dma_receive_config(usart_base, USART_DENR_DISABLE);
        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_FAILED;
    }

    DRV_UART_LOGD("DMA RX enabled for port %d, buffer_size=%d",
                  port, ctrl->config.dma_rx_buf_size);

    return 0;
}

/*********************************************************************
 * @brief   禁能DMA接收
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    无
 *********************************************************************/
static int _drv_uart_disable_dma_rx(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_dma_channel_id_e dma_ch;

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];
    dma_ch = s_uart_rx_dma_ch[port];

    /* 检查是否支持DMA */
    if (dma_ch >= DRV_DMA_MAX)
    {
        return 0;  /* UART4无DMA，直接返回成功 */
    }

    /* 禁能 HTF + FTF 中断 */
    drv_dma_int_disable(dma_ch, DRV_DMA_INT_HTF | DRV_DMA_INT_FTF);

    /* 注销 HTF/FTF 回调 */
    drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_HTF);
    drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);

    /* 停止DMA传输 */
    drv_dma_stop(dma_ch);

    /* 禁能UART DMA接收请求 */
    usart_dma_receive_config(usart_base, USART_DENR_DISABLE);

    /* 重置位置跟踪 */
    s_uart_ctrl[port].dma_rx_last_pos = 0U;

    /* 反初始化DMA通道 */
    drv_dma_deinit(dma_ch);

    DRV_UART_LOGD("DMA RX disabled for port %d", port);

    return 0;
}

/*********************************************************************
 * @brief   轮询发送（所有模式的基础降级方案）
 * @param   port    UART端口号
 * @param   data    发送数据缓冲区
 * @param   len     发送数据长度
 * @return  实际发送字节数
 *********************************************************************/
static int32_t _uart_send_polling(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    uint16_t i;
    uint32_t usart_base = s_usart_base[port];
    TickType_t start_tick, elapsed_tick;

    DRV_UART_LOGD("UART port %d send %d bytes (polling mode)", port, len);

    start_tick = xTaskGetTickCount();

    for (i = 0; i < len; i++)
    {
        usart_data_transmit(usart_base, data[i]);

        /* 等待发送完成（带超时） */
        while (usart_flag_get(usart_base, USART_FLAG_TBE) == RESET)
        {
            elapsed_tick = xTaskGetTickCount() - start_tick;
            if (elapsed_tick >= pdMS_TO_TICKS(UART_TX_TIMEOUT_MS))
            {
                DRV_UART_LOGE("Polling TX TBE timeout at byte %d/%d", i, len);
                return i;  /* 返回已发送字节数 */
            }
        }
    }

    /* 等待最后一帧发送完成（带超时） */
    while (usart_flag_get(usart_base, USART_FLAG_TC) == RESET)
    {
        elapsed_tick = xTaskGetTickCount() - start_tick;
        if (elapsed_tick >= pdMS_TO_TICKS(UART_TX_TIMEOUT_MS))
        {
            DRV_UART_LOGE("Polling TX TC timeout");
            return len;  /* 数据已写入，返回总长度 */
        }
    }

    return len;
}

/*********************************************************************
 * @brief   DMA同步发送（查询硬件FTF标志）
 * @param   port    UART端口号
 * @param   data    发送数据缓冲区
 * @param   len     发送数据长度
 * @return  实际发送字节数
 *********************************************************************/
static int32_t _uart_send_dma_sync(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    uint32_t usart_base = s_usart_base[port];
    drv_dma_channel_id_e dma_ch;
    drv_dma_config_t dma_config;
    uint32_t dma_request;
    uint32_t dma_periph;
    dma_channel_enum dma_ch_enum;
    TickType_t start_tick, elapsed_tick;

    dma_ch = s_uart_tx_dma_ch[port];

    /* 检查是否支持DMA（UART4无DMA） */
    if (dma_ch >= DRV_DMA_MAX)
    {
        DRV_UART_LOGW("Port %d does not support DMA TX, fallback to polling", port);
        return _uart_send_polling(port, data, len);
    }

    /* 获取DMA请求源 */
    dma_request = s_uart_dma_request[port][1];  /* [0]=RX, [1]=TX */

    DRV_UART_LOGD("UART port %d send %d bytes (DMA sync mode)", port, len);

    /* 配置DMA参数 */
    dma_config.request_id = dma_request;
    dma_config.periph_addr = usart_base + 0x04U;  /* USART_DATA寄存器偏移 */
    dma_config.memory_addr = (uint32_t)data;
    dma_config.periph_width = DRV_DMA_WIDTH_8BIT;
    dma_config.memory_width = DRV_DMA_WIDTH_8BIT;
    dma_config.transfer_number = len;
    dma_config.direction = DRV_DMA_DIR_MEMORY_TO_PERIPH;
    dma_config.priority = DRV_DMA_PRIORITY_HIGH;
    dma_config.mode = DRV_DMA_MODE_NORMAL;
    dma_config.periph_inc = false;
    dma_config.memory_inc = true;

    /* 初始化DMA通道 */
    if (drv_dma_init(dma_ch, &dma_config) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX init failed for port %d", port);
        return _uart_send_polling(port, data, len);
    }

    /* 使能UART DMA发送请求 */
    usart_dma_transmit_config(usart_base, USART_DENT_ENABLE);

    /* 启动DMA传输 */
    if (drv_dma_start(dma_ch) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX start failed for port %d", port);
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_deinit(dma_ch);
        return _uart_send_polling(port, data, len);
    }

    /* 获取DMA外设基地址和通道枚举 */
    if (dma_ch < DRV_DMA1_CH0)
    {
        /* DMA0 通道 */
        dma_periph = DMA0;
        dma_ch_enum = (dma_channel_enum)dma_ch;  /* DMA0_CH0-6 */
    }
    else
    {
        /* DMA1 通道 */
        dma_periph = DMA1;
        dma_ch_enum = (dma_channel_enum)(dma_ch - DRV_DMA1_CH0);  /* DMA1_CH0 */
    }

    /* 等待FTF标志置位（带超时） */
    start_tick = xTaskGetTickCount();
    while (dma_flag_get(dma_periph, dma_ch_enum, DMA_FLAG_FTF) == RESET)
    {
        elapsed_tick = xTaskGetTickCount() - start_tick;
        if (elapsed_tick >= pdMS_TO_TICKS(UART_TX_TIMEOUT_MS))
        {
            DRV_UART_LOGE("DMA TX FTF timeout for port %d", port);
            drv_dma_stop(dma_ch);
            usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
            drv_dma_deinit(dma_ch);
            return _uart_send_polling(port, data, len);
        }
    }

    /* 清除FTF标志 */
    dma_flag_clear(dma_periph, dma_ch_enum, DMA_FLAG_FTF);

    /* 等待最后一帧发送完成（带超时） */
    start_tick = xTaskGetTickCount();
    while (usart_flag_get(usart_base, USART_FLAG_TC) == RESET)
    {
        elapsed_tick = xTaskGetTickCount() - start_tick;
        if (elapsed_tick >= pdMS_TO_TICKS(UART_TX_TIMEOUT_MS))
        {
            DRV_UART_LOGE("DMA TX TC timeout for port %d", port);
            break;  /* 超时退出，数据已发送到UART */
        }
    }

