Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    /* 禁能UART DMA发送请求 */
    usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);

    /* 反初始化DMA通道 */
    drv_dma_deinit(dma_ch);

    return len;
}

/*********************************************************************
 * @brief   DMA异步发送（FreeRTOS信号量等待）
 * @param   port    UART端口号
 * @param   data    发送数据缓冲区
 * @param   len     发送数据长度
 * @return  实际发送字节数
 *********************************************************************/
static int32_t _uart_send_dma_async(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    uint32_t usart_base = s_usart_base[port];
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_dma_channel_id_e dma_ch;
    drv_dma_config_t dma_config;
    uint32_t dma_request;
    TickType_t start_tick, elapsed_tick;

    dma_ch = s_uart_tx_dma_ch[port];

    /* 检查是否支持DMA（UART4无DMA） */
    if (dma_ch >= DRV_DMA_MAX)
    {
        DRV_UART_LOGW("Port %d does not support DMA TX, fallback to polling", port);
        return _uart_send_polling(port, data, len);
    }

    /* 获取DMA请求源 */
    dma_request = s_uart_dma_request[port][1];  /* [0]=RX, [1]=TX */

    DRV_UART_LOGD("UART port %d send %d bytes (DMA async mode)", port, len);

    /* 清空信号量（确保初始状态） */
    xSemaphoreTake(ctrl->tx_sem, 0);

    /* 标记本端口DMA发送进行中（ISR回调通过此标志定位端口） */
    ctrl->dma_tx_active = true;
    ctrl->dma_tx_len = len;

    /* 配置DMA参数 */
    dma_config.request_id = dma_request;
    dma_config.periph_addr = usart_base + 0x04U;  /* USART_DATA寄存器偏移 */
    dma_config.memory_addr = (uint32_t)data;
    dma_config.periph_width = DRV_DMA_WIDTH_8BIT;
    dma_config.memory_width = DRV_DMA_WIDTH_8BIT;
    dma_config.transfer_number = len;
    dma_config.direction = DRV_DMA_DIR_MEMORY_TO_PERIPH;
    dma_config.priority = DRV_DMA_PRIORITY_HIGH;
    dma_config.mode = DRV_DMA_MODE_NORMAL;
    dma_config.periph_inc = false;
    dma_config.memory_inc = true;

    /* 初始化DMA通道 */
    if (drv_dma_init(dma_ch, &dma_config) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX init failed for port %d", port);
        ctrl->dma_tx_active = false;
        return _uart_send_polling(port, data, len);
    }

    /* 使能DMA传输完成中断（异步模式必须，使用dma_driver API） */
    if (drv_dma_int_enable(dma_ch, DRV_DMA_INT_FTF, 3) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX interrupt enable failed for port %d", port);
        drv_dma_deinit(dma_ch);
        ctrl->dma_tx_active = false;
        return _uart_send_polling(port, data, len);
    }

    /* 注册DMA TX完成回调（使用dma_driver回调机制） */
    if (drv_dma_callback_register(dma_ch, DRV_DMA_INT_FTF, uart_dma_tx_isr_callback) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX callback register failed for port %d", port);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_deinit(dma_ch);
        ctrl->dma_tx_active = false;
        return _uart_send_polling(port, data, len);
    }

    /* 使能UART DMA发送请求 */
    usart_dma_transmit_config(usart_base, USART_DENT_ENABLE);

    /* 启动DMA传输 */
    if (drv_dma_start(dma_ch) != DRV_DMA_ERR_OK)
    {
        DRV_UART_LOGE("DMA TX start failed for port %d", port);
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_deinit(dma_ch);
        ctrl->dma_tx_active = false;
        return _uart_send_polling(port, data, len);
    }

    /* 等待信号量（任务挂起，CPU可执行其他任务） */
    if (xSemaphoreTake(ctrl->tx_sem, pdMS_TO_TICKS(UART_TX_TIMEOUT_MS)) != pdTRUE)
    {
        DRV_UART_LOGE("DMA TX timeout for port %d", port);

        /* 先清标志（防止ISR再给信号量），再停DMA */
        ctrl->dma_tx_active = false;
        drv_dma_stop(dma_ch);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);

        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_TIMEOUT;
    }

    /* 等待最后一帧发送完成（带超时） */
    start_tick = xTaskGetTickCount();
    while (usart_flag_get(usart_base, USART_FLAG_TC) == RESET)
    {
        elapsed_tick = xTaskGetTickCount() - start_tick;
        if (elapsed_tick >= pdMS_TO_TICKS(UART_TX_TIMEOUT_MS))
        {
            DRV_UART_LOGE("DMA async TX TC timeout for port %d", port);
            break;  /* 超时退出，数据已发送到UART */
        }
    }

    /* 禁能DMA中断（防止新的中断触发） */
    drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);

    /* 禁能UART DMA发送请求 */
    usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);

    /* 清除本端口DMA发送标志 */
    ctrl->dma_tx_active = false;

    /* 注销DMA TX回调 */
    drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);

    /* 反初始化DMA通道 */
    drv_dma_deinit(dma_ch);

    return len;
}

/*********************************************************************
 * @brief   DMA TX 完成回调（在中断中调用）
 * @param   None
 * @note    此函数由 dma_driver 的中断回调机制调用
 *********************************************************************/
static void uart_dma_tx_isr_callback(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e port;
    drv_uart_ctrl_t *ctrl;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* 通过 DMA 通道号直接定位端口（无歧义） */
    port = _uart_find_port_by_tx_dma_ch(channel_id);
    if (port >= DRV_UART_PORT_MAX)
    {
        return;
    }

    ctrl = &s_uart_ctrl[port];

    /* 安全检查：防止超时清理后的过期 ISR 触发 */
    if (!ctrl->dma_tx_active)
    {
        return;
    }

    /* 清除本端口DMA发送标志 */
    ctrl->dma_tx_active = false;

    /* 通知应用层发送完成（必须在给信号量之前调用） */
    if (ctrl->config.tx_callback != NULL)
    {
        ctrl->config.tx_callback(port, ctrl->dma_tx_len);
    }

    /* 唤醒等待发送完成的任务 */
    if (ctrl->tx_sem != NULL)
    {
        xSemaphoreGiveFromISR(ctrl->tx_sem, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken)
        {
            portYIELD();
        }
    }
}

/*********************************************************************
 * @brief   环形队列写入（线程安全）
 * @param   port    UART端口号
 * @param   data    数据指针
 * @param   len     数据长度
 * @return  实际写入的字节数
 *********************************************************************/
static int32_t _uart_ring_queue_push(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_uart_ring_tx_ctrl_t *ring_ctrl = ctrl->ring_tx_ctrl;
    uint16_t write_idx, count, free_space, i;

