Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    if (ring_ctrl == NULL || data == NULL || len == 0 ||
        ring_ctrl->tx_ring_queue == NULL)
    {
        return DRV_UART_ERR_INVALID_PARAM;
    }

    /* 获取互斥锁 */
    if (xSemaphoreTake(ring_ctrl->tx_ring_mutex, pdMS_TO_TICKS(100)) != pdTRUE)
    {
        DRV_UART_LOGW("Ring queue mutex timeout for port %d", port);
        return DRV_UART_ERR_TIMEOUT;
    }

    write_idx = ring_ctrl->tx_ring_write_idx;
    count = ring_ctrl->tx_ring_count;
    free_space = ring_ctrl->tx_ring_queue_size - count;

    /* 检查空间 */
    if (len > free_space)
    {
        len = free_space;  /* 截断到可用空间 */
    }

    /* 写入数据 */
    for (i = 0; i < len; i++)
    {
        ring_ctrl->tx_ring_queue[write_idx] = data[i];
        write_idx = (write_idx + 1) % ring_ctrl->tx_ring_queue_size;
    }

    /* 更新状态 */
    ring_ctrl->tx_ring_write_idx = write_idx;
    ring_ctrl->tx_ring_count += len;

    /* 释放互斥锁 */
    xSemaphoreGive(ring_ctrl->tx_ring_mutex);

    return len;
}

/*********************************************************************
 * @brief   环形队列读取（线程安全）
 * @param   port        UART端口号
 * @param   data        数据缓冲区
 * @param   max_len     最大读取长度
 * @return  实际读取的字节数
 *********************************************************************/
static uint16_t _uart_ring_queue_pop(drv_uart_port_e port, uint8_t *data, uint16_t max_len)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_uart_ring_tx_ctrl_t *ring_ctrl = ctrl->ring_tx_ctrl;
    uint16_t read_idx, count, i;

    if (ring_ctrl == NULL || data == NULL || max_len == 0 ||
        ring_ctrl->tx_ring_queue == NULL)
    {
        return 0;
    }

    /* 获取互斥锁 */
    if (xSemaphoreTake(ring_ctrl->tx_ring_mutex, pdMS_TO_TICKS(100)) != pdTRUE)
    {
        DRV_UART_LOGW("Ring queue mutex timeout for port %d", port);
        return 0;
    }

    read_idx = ring_ctrl->tx_ring_read_idx;
    count = ring_ctrl->tx_ring_count;

    /* 检查数据量 */
    if (max_len > count)
    {
        max_len = count;  /* 截断到可用数据 */
    }

    /* 读取数据 */
    for (i = 0; i < max_len; i++)
    {
        data[i] = ring_ctrl->tx_ring_queue[read_idx];
        read_idx = (read_idx + 1) % ring_ctrl->tx_ring_queue_size;
    }

    /* 更新状态 */
    ring_ctrl->tx_ring_read_idx = read_idx;
    ring_ctrl->tx_ring_count -= max_len;

    /* 释放互斥锁 */
    xSemaphoreGive(ring_ctrl->tx_ring_mutex);

    return max_len;
}

/*********************************************************************
 * @brief   环形队列读取（中断安全版本，无锁）
 * @param   ring_ctrl   环形队列控制指针
 * @param   data        数据缓冲区
 * @param   max_len     最大读取长度
 * @return  实际读取的字节数
 * @note    仅用于 FTF 中断回调，使用临界区保护计数器访问
 *********************************************************************/
static uint16_t _uart_ring_queue_pop_isr(drv_uart_ring_tx_ctrl_t *ring_ctrl, uint8_t *data, uint16_t max_len)
{
    uint16_t read_idx, count, i;

    if (ring_ctrl == NULL || data == NULL || max_len == 0 ||
        ring_ctrl->tx_ring_queue == NULL)
    {
        return 0;
    }

    /* 进入临界区（关中断） */
    taskENTER_CRITICAL();

    /* 直接读取（中断中不使用互斥锁） */
    read_idx = ring_ctrl->tx_ring_read_idx;
    count = ring_ctrl->tx_ring_count;

    /* 检查数据量 */
    if (max_len > count)
    {
        max_len = count;  /* 截断到可用数据 */
    }

    /* 读取数据 */
    for (i = 0; i < max_len; i++)
    {
        data[i] = ring_ctrl->tx_ring_queue[read_idx];
        read_idx = (read_idx + 1) % ring_ctrl->tx_ring_queue_size;
    }

    /* 更新状态 */
    ring_ctrl->tx_ring_read_idx = read_idx;
    ring_ctrl->tx_ring_count -= max_len;

    /* 退出临界区（开中断） */
    taskEXIT_CRITICAL();

    return max_len;
}

/*********************************************************************
 * @brief   DMA RX 增量数据拷贝（HTF/FTF/IDLE 共用）
 * @param   port    UART端口号
 * @note    根据 dma_rx_last_pos 和当前 DMA 位置计算增量，写入 RingBuffer
 * @note    仅在 ISR 上下文（HTF/FTF/IDLE）调用，单写者无竞争
 *********************************************************************/
static void _uart_dma_rx_copy_data(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_dma_channel_id_e dma_ch = s_uart_rx_dma_ch[port];
    uint16_t remaining, current_pos;
    uint16_t buf_size = ctrl->config.dma_rx_buf_size;
    uint16_t last_pos;
    uint16_t copy_len;
    uint16_t tail_len;

    if (dma_ch >= DRV_DMA_MAX)
    {
        return;
    }

    /* 计算当前 DMA 写入位置 */
    remaining = drv_dma_get_transfer_number(dma_ch);
    current_pos = buf_size - remaining;  /* 0 ~ buf_size（remaining=0 时 = buf_size） */

    last_pos = ctrl->dma_rx_last_pos;

    if (current_pos > last_pos)
    {
        /* 无回绕：直接拷贝增量部分 */
        copy_len = current_pos - last_pos;
        if (copy_len > 0 && ctrl->config.ringbuf != NULL)
        {
            my_rb_write(ctrl->config.ringbuf, &ctrl->config.dma_rx_buf[last_pos], copy_len);
        }
    }
    else if (current_pos < last_pos)
    {
        /* 回绕：先拷贝尾部，再拷贝头部 */
        tail_len = buf_size - last_pos;
        if (tail_len > 0 && ctrl->config.ringbuf != NULL)
        {
            my_rb_write(ctrl->config.ringbuf, &ctrl->config.dma_rx_buf[last_pos], tail_len);
        }
        if (current_pos > 0 && ctrl->config.ringbuf != NULL)
        {
            my_rb_write(ctrl->config.ringbuf, &ctrl->config.dma_rx_buf[0], current_pos);
        }
    }
    /* current_pos == last_pos：无新数据，跳过 */

    /* 更新位置（规范化：FPF 后 current_pos 可能为 buf_size，归一化到 0） */
    ctrl->dma_rx_last_pos = (current_pos >= buf_size) ? 0U : current_pos;
}

/*********************************************************************
 * @brief   DMA RX 半传输中断回调（HTF）
 * @note    DMA 缓冲区半满时触发，将前半段增量拷贝到 RingBuffer，并通知任务读取
 *********************************************************************/
static void uart_dma_rx_htf_callback(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e port;
    drv_uart_ctrl_t *ctrl = NULL;
    uint16_t ringbuf_len;

    port = _uart_find_port_by_rx_dma_ch(channel_id);
    if (port < DRV_UART_PORT_MAX)
    {
        ctrl = &s_uart_ctrl[port];

