Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
        _uart_dma_rx_copy_data(port);

        /* 通知任务读取数据 */
        if (ctrl->config.rx_callback != NULL && ctrl->config.ringbuf != NULL)
        {
            ringbuf_len = (uint16_t)my_rb_get_data_size(ctrl->config.ringbuf);
            if (ringbuf_len > 0)
            {
                ctrl->config.rx_callback(port, ringbuf_len);
            }
        }
    }
}

/*********************************************************************
 * @brief   DMA RX 全传输中断回调（FTF）
 * @note    DMA 缓冲区回绕时触发，将后半段增量拷贝到 RingBuffer，并通知任务读取
 *********************************************************************/
static void uart_dma_rx_ftf_callback(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e port;
    drv_uart_ctrl_t *ctrl = NULL;
    uint16_t ringbuf_len;

    port = _uart_find_port_by_rx_dma_ch(channel_id);
    if (port < DRV_UART_PORT_MAX)
    {
        ctrl = &s_uart_ctrl[port];

        _uart_dma_rx_copy_data(port);

        /* 通知任务读取数据 */
        if (ctrl->config.rx_callback != NULL && ctrl->config.ringbuf != NULL)
        {
            ringbuf_len = (uint16_t)my_rb_get_data_size(ctrl->config.ringbuf);
            if (ringbuf_len > 0)
            {
                ctrl->config.rx_callback(port, ringbuf_len);
            }
        }
    }
}

/*********************************************************************
 * @brief   DMA 环形发送 FTF 中断回调
 * @note    当前 DMA 缓冲区发送完成后，自动切换到下一个缓冲区继续发送
 * @note    调用时机：DMA FTF 中断触发时（缓冲区数据传输完成）
 * @note    工作流程：
 *          1. 校验当前发送端口有效性
 *          2. 切换到下一个双缓冲区域
 *          3. 从发送队列预填充数据到新缓冲区
 *          4. 若有数据：快速重配置 DMA 继续发送
 *          5. 若无数据：停止 DMA 发送，清除活跃标志
 *********************************************************************/
static void uart_dma_ring_tx_ftf_callback(drv_dma_channel_id_e channel_id)
{
    drv_uart_port_e port;
    drv_uart_ctrl_t *ctrl = NULL;
    drv_uart_ring_tx_ctrl_t *ring_ctrl = NULL;
    uint8_t next_buf_idx;
    uint16_t data_len;
    uint32_t usart_base;
    drv_dma_channel_id_e dma_ch;

    /* 通过 DMA 通道号直接定位端口 */
    port = _uart_find_port_by_tx_dma_ch(channel_id);
    if (port >= DRV_UART_PORT_MAX || s_uart_ctrl[port].ring_tx_ctrl == NULL)
    {
        DRV_UART_LOGE("Ring TX control is NULL for port %d", port);
        return;
    }

    ctrl = &s_uart_ctrl[port];
    ring_ctrl = ctrl->ring_tx_ctrl;

    /* 切换到下一个双缓冲区（0->1 或 1->0） */
    next_buf_idx = (ring_ctrl->current_buf_idx + 1) % 2;

    /* 从发送队列预填充数据到下一个缓冲区（ISR 安全版本） */
    data_len = _uart_ring_queue_pop_isr(ring_ctrl,
                                        &ring_ctrl->dma_tx_buf[next_buf_idx * ring_ctrl->dma_tx_buf_size],
                                        ring_ctrl->dma_tx_buf_size);

    if (data_len > 0)
    {
        /* 有数据待发送：更新缓冲区状态并配置 DMA */
        ring_ctrl->current_buf_idx = next_buf_idx;
        ring_ctrl->buf_fill_len[next_buf_idx] = data_len;
        ring_ctrl->buf_state[next_buf_idx] = DRV_UART_DMA_BUF_TX;

        DRV_UART_LOGD("FTF: Switch to buf %d, len=%d", next_buf_idx, data_len);

        /* 获取硬件资源标识 */
        usart_base = s_usart_base[port];
        dma_ch = s_uart_tx_dma_ch[port];

        /* 校验 DMA 通道有效性 */
        if (dma_ch >= DRV_DMA_MAX)
        {
            DRV_UART_LOGE("FTF: Invalid DMA channel for port %d", port);
            ring_ctrl->dma_tx_active = false;
            return;
        }

        /* 快速重配置 DMA：仅更新内存地址和传输数量（ISR 安全） */
        if (drv_dma_reconfig_fast(dma_ch,
                                    (uint32_t)&ring_ctrl->dma_tx_buf[next_buf_idx * ring_ctrl->dma_tx_buf_size],
                                    data_len) != DRV_DMA_ERR_OK)
        {
            DRV_UART_LOGE("FTF: DMA reconfig failed for port %d", port);
            usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
            ring_ctrl->dma_tx_active = false;
            return;
        }

        /* DMA 重配置成功，保持 dma_tx_active = true，继续循环发送 */
    }
    else
    {
        /* 发送队列已空：停止 DMA 发送，清除活跃标志 */
        DRV_UART_LOGD("FTF: No data, stop DMA for port %d", port);
        ring_ctrl->dma_tx_active = false;
    }
}

/*********************************************************************
 * @brief   中断发送模式（TXE中断，无需DMA）
 * @param   port    UART端口号
 * @param   data    发送数据缓冲区
 * @param   len     发送数据长度
 * @return  实际发送字节数
 * @note    数据写入TX缓冲区，使能TXE中断，由中断逐字节发送
 * @note    TX缓冲区为线性缓冲区（非环形），每次发送必须等待上一次完成
 * @note    适合中等频率发送场景，高频连续发送建议使用DMA_DUAL_BUF模式
 *********************************************************************/
static int32_t _uart_send_interrupt(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_uart_tx_irq_ctrl_t *tx_ctrl = ctrl->tx_irq_ctrl;
    uint32_t usart_base = s_usart_base[port];
    uint16_t i;

    if (tx_ctrl == NULL)
    {
        DRV_UART_LOGE("TX IRQ control is NULL for port %d", port);
        return DRV_UART_ERR_FAILED;
    }

    /* 检查是否正在发送 */
    if (tx_ctrl->tx_active == true)
    {
        DRV_UART_LOGW("TX IRQ busy for port %d", port);
        return DRV_UART_ERR_NOT_READY;
    }

    /* 检查数据长度 */
    if (len == 0 || len > tx_ctrl->tx_buf_size)
    {
        DRV_UART_LOGE("Invalid TX length %d for port %d (max=%d)", len, port, tx_ctrl->tx_buf_size);
        return DRV_UART_ERR_INVALID_PARAM;
    }

    DRV_UART_LOGD("UART port %d send %d bytes (interrupt mode)", port, len);

    /* 进入临界区（防止中断同时访问） */
    taskENTER_CRITICAL();

    /* 数据写入TX缓冲区 */
    for (i = 0; i < len; i++)
    {
        tx_ctrl->tx_buf[i] = data[i];
    }
    tx_ctrl->tx_write_idx = len;
    tx_ctrl->tx_read_idx = 0;
    tx_ctrl->tx_count = len;
    tx_ctrl->tx_total_len = len;
    tx_ctrl->tx_active = true;

    /* 退出临界区 */
    taskEXIT_CRITICAL();

    /* 使能TXE中断，启动发送 */
    usart_interrupt_enable(usart_base, USART_INT_TBE);

    return len;
}

/*********************************************************************
 * @brief   TXE中断处理（在中断中调用）
 * @param   port    UART端口号
 * @note    逐字节从TX缓冲区取数据写入DR寄存器
 *********************************************************************/
static void _uart_tx_irq_handler(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_uart_tx_irq_ctrl_t *tx_ctrl = ctrl->tx_irq_ctrl;
    uint32_t usart_base = s_usart_base[port];

