Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    if (tx_ctrl == NULL || tx_ctrl->tx_active == false)
    {
        return;
    }

    /* 进入临界区（保护缓冲区访问） */
    taskENTER_CRITICAL();

    if (tx_ctrl->tx_count > 0)
    {
        /* 从缓冲区取1字节写入DR寄存器 */
        USART_DATA(usart_base) = tx_ctrl->tx_buf[tx_ctrl->tx_read_idx];
        tx_ctrl->tx_read_idx = (tx_ctrl->tx_read_idx + 1) % tx_ctrl->tx_buf_size;
        tx_ctrl->tx_count--;
    }
    else
    {
        /* 缓冲区为空，发送完成 */
        tx_ctrl->tx_active = false;

        /* 退出临界区（在关闭中断之前） */
        taskEXIT_CRITICAL();

        /* 关闭TXE中断 */
        usart_interrupt_disable(usart_base, USART_INT_TBE);

        /* 注意：以下代码仍在中断上下文中执行
         * 回调函数必须快速执行，不能阻塞或调用FreeRTOS API（非FromISR版本） */
        if (ctrl->config.tx_callback != NULL)
        {
            ctrl->config.tx_callback(port, tx_ctrl->tx_total_len);
        }
        return;
    }

    /* 退出临界区 */
    taskEXIT_CRITICAL();
}

/*********************************************************************
 * @brief   启动 DMA 双缓冲发送
 * @param   port    UART端口号
 * @return  0=成功，<0=失败
 *********************************************************************/
static int32_t _uart_send_ring_start(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl = &s_uart_ctrl[port];
    drv_uart_ring_tx_ctrl_t *ring_ctrl = ctrl->ring_tx_ctrl;
    uint32_t usart_base = s_usart_base[port];
    drv_dma_channel_id_e dma_ch = s_uart_tx_dma_ch[port];
    uint32_t dma_request = s_uart_dma_request[port][1];  /* [0]=RX, [1]=TX */
    drv_dma_config_t dma_cfg;
    uint16_t data_len;

    if (ring_ctrl == NULL)
    {
        return DRV_UART_ERR_FAILED;
    }

    /* 检查是否支持DMA（UART4无DMA） */
    if (dma_ch >= DRV_DMA_MAX)
    {
        DRV_UART_LOGW("Port %d does not support DMA TX, fallback to polling", port);
        return DRV_UART_ERR_FAILED;
    }

    /* 从环形队列取数据到 Buffer 0 */
    data_len = _uart_ring_queue_pop(port, ring_ctrl->dma_tx_buf, ring_ctrl->dma_tx_buf_size);

    if (data_len == 0)
    {
        return 0;  /* 无数据 */
    }

    /* 配置并启动 DMA */
    drv_dma_deinit(dma_ch);

    dma_cfg.request_id = dma_request;
    dma_cfg.periph_addr = usart_base + 0x04U;  /* DATA寄存器 */
    dma_cfg.memory_addr = (uint32_t)ring_ctrl->dma_tx_buf;  /* Buffer 0 */
    dma_cfg.periph_width = DRV_DMA_WIDTH_8BIT;
    dma_cfg.memory_width = DRV_DMA_WIDTH_8BIT;
    dma_cfg.transfer_number = data_len;
    dma_cfg.direction = DRV_DMA_DIR_MEMORY_TO_PERIPH;
    dma_cfg.priority = DRV_DMA_PRIORITY_HIGH;
    dma_cfg.mode = DRV_DMA_MODE_NORMAL;
    dma_cfg.periph_inc = false;
    dma_cfg.memory_inc = true;

    if (drv_dma_init(dma_ch, &dma_cfg) != DRV_DMA_ERR_OK)
    {
        return DRV_UART_ERR_FAILED;
    }

    /* 注册回调 */
    drv_dma_callback_register(dma_ch, DRV_DMA_INT_FTF, uart_dma_ring_tx_ftf_callback);

    /* 使能 UART DMA 发送 */
    usart_dma_transmit_config(usart_base, USART_DENT_ENABLE);

    /* 使能 DMA 中断 */
    drv_dma_int_enable(dma_ch, DRV_DMA_INT_FTF, 3);

    /* 启动 DMA */
    if (drv_dma_start(dma_ch) != DRV_DMA_ERR_OK)
    {
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_deinit(dma_ch);
        return DRV_UART_ERR_FAILED;
    }

    /* 设置活动标志 */
    ring_ctrl->dma_tx_active = true;
    ring_ctrl->current_buf_idx = 0;  /* 从 Buffer 0 开始 */
    ring_ctrl->buf_fill_len[0] = data_len;
    ring_ctrl->buf_state[0] = DRV_UART_DMA_BUF_TX;
    ring_ctrl->buf_state[1] = DRV_UART_DMA_BUF_IDLE;

    return data_len;
}

/*********************************************************************
 * 接口函数实现
 *********************************************************************/

/*********************************************************************
 * @brief   初始化UART端口
 * @param   config  UART配置结构体指针（应用层传入）
 * @return  0表示成功，-1表示失败（参数错误或端口已初始化）
 * @note    应用层需确保配置参数合法，所有内存资源由应用层分配管理
 *********************************************************************/
int drv_uart_init(const drv_uart_config_t *config)
{
    drv_uart_ctrl_t *ctrl;
    drv_uart_port_e port;

    /* 断言检查：配置指针不能为空 */
    DRV_UART_ASSERT(config != NULL);

    /* 参数检查 */
    if (_drv_uart_check_param(config) != 0)
    {
        DRV_UART_LOGE("Invalid config parameter for port");
        return DRV_UART_ERR_FAILED;
    }

    port = config->port;

    /* 检查UART端口是否配置为未使用 */
    switch (port)
    {
        case DRV_UART_PORT_USART0:
#if DRV_USART0_GPIO_SEL == DRV_USART0_NO_USE
            DRV_UART_LOGE("USART0 is not configured (NO_USE), please check DRV_USART0_GPIO_SEL");
            return DRV_UART_ERR_FAILED;
#endif
            break;

        case DRV_UART_PORT_USART1:
#if DRV_USART1_GPIO_SEL == DRV_USART1_NO_USE
            DRV_UART_LOGE("USART1 is not configured (NO_USE), please check DRV_USART1_GPIO_SEL");
            return DRV_UART_ERR_FAILED;
#endif
            break;

        case DRV_UART_PORT_USART2:
#if DRV_UART2_GPIO_SEL == DRV_UART2_NO_USE
            DRV_UART_LOGE("UART2 is not configured (NO_USE), please check DRV_UART2_GPIO_SEL");
            return DRV_UART_ERR_FAILED;
#endif
            break;

        case DRV_UART_PORT_UART3:
#if DRV_UART3_GPIO_SEL == DRV_UART3_NO_USE
            DRV_UART_LOGE("UART3 is not configured (NO_USE), please check DRV_UART3_GPIO_SEL");
            return DRV_UART_ERR_FAILED;
#endif
            break;

        case DRV_UART_PORT_UART4:
#if DRV_UART4_GPIO_SEL == DRV_UART4_NO_USE
            DRV_UART_LOGE("UART4 is not configured (NO_USE), please check DRV_UART4_GPIO_SEL");
            return DRV_UART_ERR_FAILED;
#endif
            break;

        default:
            break;
    }

    ctrl = &s_uart_ctrl[port];

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    /* 检查端口是否已注册 */
    if (ctrl->state != DRV_UART_STATE_UNINIT)
    {
        DRV_UART_LOGW("UART port %d already registered, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    /* 保存配置参数 */
    memcpy(&ctrl->config, config, sizeof(drv_uart_config_t));
    ctrl->tx_mode = config->tx_mode;

    /* 初始化接收模式标识 */
    if (config->use_dma_rx == true)
    {
        ctrl->rx_mode = (config->use_ringbuf == true) ? DRV_UART_RX_MODE_DMA_RINGBUF : DRV_UART_RX_MODE_DMA_RXBUF;
    }
    else
    {
        ctrl->rx_mode = (config->use_ringbuf == true) ? DRV_UART_RX_MODE_NODMA_RINGBUF : DRV_UART_RX_MODE_NODMA_RXBUF;
    }

    /* 初始化中断使能标志 */
    ctrl->irq_enabled = DRV_UART_IRQ_RBNE | DRV_UART_IRQ_ERR;  /* RXNE和ERR总是使能 */
    if (config->use_idle == true)
    {
        ctrl->irq_enabled |= DRV_UART_IRQ_IDLE;
    }

