Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    /* 根据配置创建发送互斥锁 */
    if (config->use_tx_mutex == true)
    {
        ctrl->tx_mutex = xSemaphoreCreateMutex();
        if (ctrl->tx_mutex == NULL)
        {
            DRV_UART_LOGE("Failed to create TX mutex for port %d", port);
            return DRV_UART_ERR_FAILED;
        }

        DRV_UART_LOGD("TX mutex created for port %d", port);
    }
    else
    {
        ctrl->tx_mutex = NULL;
        DRV_UART_LOGD("TX mutex disabled for port %d", port);
    }

    /* 根据 TX 模式创建资源 */
    switch (ctrl->tx_mode)
    {
        case UART_TX_MODE_INTERRUPT:
            /* 创建中断 TX 控制结构 */
            if (config->tx_buf == NULL || config->tx_buf_size == 0)
            {
                DRV_UART_LOGE("INTERRUPT mode requires tx_buf from application");
                if (ctrl->tx_mutex != NULL)
                {
                    vSemaphoreDelete(ctrl->tx_mutex);
                }
                return DRV_UART_ERR_FAILED;
            }

            ctrl->tx_irq_ctrl = (drv_uart_tx_irq_ctrl_t *)pvPortMalloc(sizeof(drv_uart_tx_irq_ctrl_t));
            if (ctrl->tx_irq_ctrl == NULL)
            {
                DRV_UART_LOGE("Failed to allocate TX IRQ control for port %d", port);
                if (ctrl->tx_mutex != NULL)
                {
                    vSemaphoreDelete(ctrl->tx_mutex);
                }
                return DRV_UART_ERR_FAILED;
            }

            /* 初始化中断 TX 控制 */
            memset(ctrl->tx_irq_ctrl, 0, sizeof(drv_uart_tx_irq_ctrl_t));
            ctrl->tx_irq_ctrl->tx_buf = config->tx_buf;
            ctrl->tx_irq_ctrl->tx_buf_size = config->tx_buf_size;
            ctrl->tx_irq_ctrl->tx_active = false;

            DRV_UART_LOGI("TX IRQ control created for port %d, buf_size=%d", port, config->tx_buf_size);
            break;

        case UART_TX_MODE_DMA_ASYNC:
            /* 创建DMA TX完成信号量 */
            ctrl->tx_sem = xSemaphoreCreateBinary();
            if (ctrl->tx_sem == NULL)
            {
                DRV_UART_LOGE("Failed to create TX semaphore for port %d", port);
                if (ctrl->tx_mutex != NULL)
                {
                    vSemaphoreDelete(ctrl->tx_mutex);
                }
                return DRV_UART_ERR_FAILED;
            }
            DRV_UART_LOGD("TX semaphore created for port %d", port);
            break;

        case UART_TX_MODE_DMA_DUAL_BUF:
            /* 创建环形 TX 控制结构（仅双缓冲模式需要） */
            if (config->use_dma_tx == true)
            {
                /* 检查应用层是否传入了缓冲区 */
                if (config->dma_tx_buf == NULL || config->dma_tx_buf_size == 0 ||
                    config->tx_ring_queue == NULL || config->tx_ring_queue_size == 0)
                {
                    DRV_UART_LOGE("DUAL_BUF mode requires dma_tx_buf and tx_ring_queue from application");
                    if (ctrl->tx_mutex != NULL)
                    {
                        vSemaphoreDelete(ctrl->tx_mutex);
                    }
                    return DRV_UART_ERR_FAILED;
                }

                ctrl->ring_tx_ctrl = (drv_uart_ring_tx_ctrl_t *)pvPortMalloc(sizeof(drv_uart_ring_tx_ctrl_t));
                if (ctrl->ring_tx_ctrl == NULL)
                {
                    DRV_UART_LOGE("Failed to allocate ring TX control for port %d", port);
                    if (ctrl->tx_mutex != NULL)
                    {
                        vSemaphoreDelete(ctrl->tx_mutex);
                    }
                    return DRV_UART_ERR_FAILED;
                }

                /* 初始化环形队列 */
                memset(ctrl->ring_tx_ctrl, 0, sizeof(drv_uart_ring_tx_ctrl_t));
                ctrl->ring_tx_ctrl->dma_tx_buf = config->dma_tx_buf;
                ctrl->ring_tx_ctrl->dma_tx_buf_size = config->dma_tx_buf_size;
                ctrl->ring_tx_ctrl->tx_ring_queue = config->tx_ring_queue;
                ctrl->ring_tx_ctrl->tx_ring_queue_size = config->tx_ring_queue_size;

                ctrl->ring_tx_ctrl->tx_ring_mutex = xSemaphoreCreateMutex();
                if (ctrl->ring_tx_ctrl->tx_ring_mutex == NULL)
                {
                    DRV_UART_LOGE("Failed to create ring queue mutex for port %d", port);
                    vPortFree(ctrl->ring_tx_ctrl);
                    ctrl->ring_tx_ctrl = NULL;
                    if (ctrl->tx_mutex != NULL)
                    {
                        vSemaphoreDelete(ctrl->tx_mutex);
                    }
                    return DRV_UART_ERR_FAILED;
                }

                DRV_UART_LOGI("Ring TX control created for port %d", port);
            }
            break;

        case UART_TX_MODE_POLLING:
        case UART_TX_MODE_DMA_SYNC:
        default:
            /* 轮询和DMA同步模式不需要额外资源（INTERRUPT模式已在上面处理） */
            break;
    }

    /* 初始化状态 */
    ctrl->state = DRV_UART_STATE_INIT;

    /* 硬件初始化 */
    if (_drv_uart_hw_init(port) != 0)
    {
        DRV_UART_LOGE("Hardware init failed for port %d", port);

        /* 释放 ring_tx_ctrl */
        if (ctrl->ring_tx_ctrl != NULL)
        {
            if (ctrl->ring_tx_ctrl->tx_ring_mutex != NULL)
            {
                vSemaphoreDelete(ctrl->ring_tx_ctrl->tx_ring_mutex);
            }
            vPortFree(ctrl->ring_tx_ctrl);
            ctrl->ring_tx_ctrl = NULL;
        }

        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->state = DRV_UART_STATE_UNINIT;
        return DRV_UART_ERR_FAILED;
    }

    /* 如果启用DMA接收 */
    if (config->use_dma_rx == true)
    {
        if (_drv_uart_enable_dma_rx(port) != 0)
        {
            DRV_UART_LOGE("DMA RX enable failed for port %d", port);
            _drv_uart_hw_deinit(port);

            /* 释放 ring_tx_ctrl */
            if (ctrl->ring_tx_ctrl != NULL)
            {
                if (ctrl->ring_tx_ctrl->tx_ring_mutex != NULL)
                {
                    vSemaphoreDelete(ctrl->ring_tx_ctrl->tx_ring_mutex);
                }
                vPortFree(ctrl->ring_tx_ctrl);
                ctrl->ring_tx_ctrl = NULL;
            }

