Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
            vSemaphoreDelete(ctrl->tx_mutex);
            ctrl->state = DRV_UART_STATE_UNINIT;
            return DRV_UART_ERR_FAILED;
        }
    }

    /* 切换到活跃状态（必须在中断使能前！） */
    ctrl->state = DRV_UART_STATE_ACTIVE;

    /* 使能中断 */
    if (_drv_uart_enable_interrupt(port) != 0)
    {
        DRV_UART_LOGE("Interrupt enable failed for port %d", port);
        if (config->use_dma_rx == true)
        {
            _drv_uart_disable_dma_rx(port);
        }
        _drv_uart_hw_deinit(port);

        /* 释放 ring_tx_ctrl */
        if (ctrl->ring_tx_ctrl != NULL)
        {
            if (ctrl->ring_tx_ctrl->tx_ring_mutex != NULL)
            {
                vSemaphoreDelete(ctrl->ring_tx_ctrl->tx_ring_mutex);
            }
            vPortFree(ctrl->ring_tx_ctrl);
            ctrl->ring_tx_ctrl = NULL;
        }

        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->state = DRV_UART_STATE_UNINIT;
        return DRV_UART_ERR_FAILED;
    }

    DRV_UART_LOGI("UART port %d initialized successfully, baudrate=%d, TX_Mode=%d, DMA_RX=%d, IDLE=%d, RingBuf=%d",
                  port, config->baudrate, config->tx_mode, config->use_dma_rx, config->use_idle, config->use_ringbuf);

    return 0;
}

/*********************************************************************
 * @brief   卸载UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口未初始化）
 * @note    释放驱动内部资源，应用层传入的内存由应用层自行管理
 *********************************************************************/
int drv_uart_deinit(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 检查端口状态 */
    if (ctrl->state == DRV_UART_STATE_UNINIT)
    {
        DRV_UART_LOGW("UART port %d not initialized", port);
        return DRV_UART_ERR_FAILED;
    }

    /* 关闭中断 */
    _drv_uart_disable_interrupt(port);

    /* 关闭DMA RX */
    if (ctrl->config.use_dma_rx == true)
    {
        _drv_uart_disable_dma_rx(port);
    }

    /* 清理进行中的 DMA TX（异步模式） */
    if (ctrl->tx_mode == UART_TX_MODE_DMA_ASYNC && ctrl->dma_tx_active)
    {
        drv_dma_channel_id_e dma_ch = s_uart_tx_dma_ch[port];
        uint32_t usart_base = s_usart_base[port];

        DRV_UART_LOGW("DMA TX active on port %d, forcing stop", port);

        ctrl->dma_tx_active = false;
        drv_dma_stop(dma_ch);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_deinit(dma_ch);
    }

    /* 清理进行中的 DMA TX（双缓冲模式） */
    if (ctrl->tx_mode == UART_TX_MODE_DMA_DUAL_BUF && ctrl->ring_tx_ctrl != NULL
        && ctrl->ring_tx_ctrl->dma_tx_active)
    {
        drv_dma_channel_id_e dma_ch = s_uart_tx_dma_ch[port];
        uint32_t usart_base = s_usart_base[port];

        DRV_UART_LOGW("DMA ring TX active on port %d, forcing stop", port);

        ctrl->ring_tx_ctrl->dma_tx_active = false;
        drv_dma_stop(dma_ch);
        drv_dma_int_disable(dma_ch, DRV_DMA_INT_FTF);
        usart_dma_transmit_config(usart_base, USART_DENT_DISABLE);
        drv_dma_callback_unregister(dma_ch, DRV_DMA_INT_FTF);
        drv_dma_deinit(dma_ch);
    }

    /* 硬件去初始化 */
    _drv_uart_hw_deinit(port);

    /* 释放互斥锁 */
    if (ctrl->tx_mutex != NULL)
    {
        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->tx_mutex = NULL;
    }

    /* 释放DMA TX信号量 */
    if (ctrl->tx_sem != NULL)
    {
        vSemaphoreDelete(ctrl->tx_sem);
        ctrl->tx_sem = NULL;
    }

    /* 释放环形 TX 控制结构 */
    if (ctrl->ring_tx_ctrl != NULL)
    {
        if (ctrl->ring_tx_ctrl->tx_ring_mutex != NULL)
        {
            vSemaphoreDelete(ctrl->ring_tx_ctrl->tx_ring_mutex);
        }
        vPortFree(ctrl->ring_tx_ctrl);
        ctrl->ring_tx_ctrl = NULL;
        DRV_UART_LOGD("Ring TX control freed for port %d", port);
    }

    /* 释放中断 TX 控制结构 */
    if (ctrl->tx_irq_ctrl != NULL)
    {
        vPortFree(ctrl->tx_irq_ctrl);
        ctrl->tx_irq_ctrl = NULL;
        DRV_UART_LOGD("TX IRQ control freed for port %d", port);
    }

    /* 清空配置 */
    memset(&ctrl->config, 0, sizeof(drv_uart_config_t));
    memset(&ctrl->context, 0, sizeof(drv_uart_context_t));

    /* 状态重置 */
    ctrl->state = DRV_UART_STATE_UNINIT;

    DRV_UART_LOGI("UART port %d deinitialized successfully", port);

    return 0;
}

/*********************************************************************
 * @brief   发送数据
 * @param   port    UART端口号
 * @param   data    待发送数据指针
 * @param   len     待发送数据长度（字节）
 * @return  实际发送的字节数，-1表示失败
 * @note    线程安全，支持普通发送和DMA发送（根据配置自动选择）
 *********************************************************************/
int drv_uart_send(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    drv_uart_ctrl_t *ctrl;
    int send_len = 0;

    /* 断言检查：参数合法性 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);
    DRV_UART_ASSERT(data != NULL);
    DRV_UART_ASSERT(len > 0);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    if (data == NULL || len == 0)
    {
        DRV_UART_LOGE("Invalid send parameter");
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查：只有活跃状态才能发送 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    /* 如果启用了互斥锁，获取互斥锁（线程安全） */
    if (ctrl->tx_mutex != NULL)
    {
        /* 使用超时机制，避免永久阻塞 */
#if DRV_UART_TX_MUTEX_TIMEOUT_MS > 0
        if (xSemaphoreTake(ctrl->tx_mutex, pdMS_TO_TICKS(DRV_UART_TX_MUTEX_TIMEOUT_MS)) != pdTRUE)
        {
            DRV_UART_LOGE("TX mutex timeout for port %d", port);
            return DRV_UART_ERR_FAILED;
        }
#else
        if (xSemaphoreTake(ctrl->tx_mutex, portMAX_DELAY) != pdTRUE)
        {
            DRV_UART_LOGE("Failed to take TX mutex for port %d", port);
            return DRV_UART_ERR_FAILED;
        }
#endif
    }

    /* 根据运行时 TX 模式选择发送方式 */
    switch (ctrl->tx_mode)
    {
        case UART_TX_MODE_POLLING:
            /* 轮询发送模式 */
            send_len = _uart_send_polling(port, data, len);
            break;

