Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
        case UART_TX_MODE_INTERRUPT:
            /* 中断发送模式（TXE中断，无需DMA） */
            if (ctrl->tx_irq_ctrl != NULL)
            {
                send_len = _uart_send_interrupt(port, data, len);
            }
            else
            {
                DRV_UART_LOGW("TX IRQ control is NULL for port %d, fallback to polling", port);
                send_len = _uart_send_polling(port, data, len);
            }
            break;

        case UART_TX_MODE_DMA_SYNC:
            /* DMA同步发送模式 */
            if (ctrl->config.use_dma_tx == true && s_uart_tx_dma_ch[port] < DRV_DMA_MAX)
            {
                send_len = _uart_send_dma_sync(port, data, len);
            }
            else
            {
                send_len = _uart_send_polling(port, data, len);
            }
            break;

        case UART_TX_MODE_DMA_ASYNC:
            /* DMA异步发送模式 */
            if (ctrl->config.use_dma_tx == true && s_uart_tx_dma_ch[port] < DRV_DMA_MAX)
            {
                send_len = _uart_send_dma_async(port, data, len);
            }
            else
            {
                send_len = _uart_send_polling(port, data, len);
            }
            break;

        case UART_TX_MODE_DMA_DUAL_BUF:
            /* DMA双缓冲循环发送模式 */
            if (ctrl->config.use_dma_tx == true && ctrl->ring_tx_ctrl != NULL && s_uart_tx_dma_ch[port] < DRV_DMA_MAX)
            {
                /* 写入环形队列（线程安全） */
                send_len = _uart_ring_queue_push(port, data, len);

                if (send_len > 0)
                {
                    /* 检查并启动 DMA（在 tx_mutex 保护下，防止竞态） */
                    /* 注意：tx_mutex 已在函数开头获取 */
                    if (!ctrl->ring_tx_ctrl->dma_tx_active)
                    {
                        _uart_send_ring_start(port);
                    }
                }
            }
            else
            {
                send_len = _uart_send_polling(port, data, len);
            }
            break;

        default:
            /* 未知模式，降级到轮询 */
            DRV_UART_LOGW("Unknown TX mode %d, fallback to polling", ctrl->tx_mode);
            send_len = _uart_send_polling(port, data, len);
            break;
    }

    /* 释放互斥锁 */
    if (ctrl->tx_mutex != NULL)
    {
        xSemaphoreGive(ctrl->tx_mutex);
    }

    return send_len;
}

/*********************************************************************
 * @brief   读取数据
 * @param   port    UART端口号
 * @param   data    读取数据存放指针
 * @param   len     期望读取的数据长度（字节）
 * @return  实际读取的字节数，-1表示失败
 * @note    从RingBuffer或接收缓存中读取数据
 *********************************************************************/
int drv_uart_read(drv_uart_port_e port, uint8_t *data, uint16_t len)
{
    drv_uart_ctrl_t *ctrl;
    int read_len = 0;
    uint32_t ringbuf_used_size;
    uint32_t ringbuf_threshold;
    uint16_t available_len;
    uint16_t i;
    uint16_t copy_len;

    /* 断言检查：参数合法性 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);
    DRV_UART_ASSERT(data != NULL);
    DRV_UART_ASSERT(len > 0);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    if (data == NULL || len == 0)
    {
        DRV_UART_LOGE("Invalid read parameter");
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    /* 判断是否启用RingBuffer */
    if (ctrl->config.use_ringbuf == true)
    {
        /* 从RingBuffer读取数据 */
        if (ctrl->config.ringbuf == NULL)
        {
            DRV_UART_LOGE("RingBuffer pointer is NULL for port %d", port);
            return DRV_UART_ERR_FAILED;
        }

        read_len = my_rb_read(ctrl->config.ringbuf, data, len);

        /* 读取数据后，如果之前已触发半满回调，现在检查是否可以复位标志 */
        if (ctrl->ringbuf_half_triggered && read_len > 0)
        {
            ringbuf_used_size = my_rb_get_data_size(ctrl->config.ringbuf);
            ringbuf_threshold = ctrl->config.ringbuf->size / 2;

            /* 当使用量低于阈值的 50% 时，复位触发标志，允许下次再次触发 */
            /* 临界区保护：防止与中断中的写操作竞争 */
            if (ringbuf_used_size < ringbuf_threshold / 2)
            {
                taskENTER_CRITICAL();
                ctrl->ringbuf_half_triggered = false;
                taskEXIT_CRITICAL();
            }
        }

        DRV_UART_LOGD("UART port %d read %d bytes from RingBuffer", port, read_len);
    }
    else
    {
        /* 从基础接收缓存读取（循环缓冲区） */
        /* 计算可读取的数据长度 */
        if (ctrl->rx_write_index >= ctrl->rx_read_index)
        {
            /* 写指针在读指针之后或相等 */
            available_len = ctrl->rx_write_index - ctrl->rx_read_index;
        }
        else
        {
            /* 写指针在读指针之前（循环） */
            available_len = ctrl->config.rx_buf_size - ctrl->rx_read_index + ctrl->rx_write_index;
        }

        /* 取期望长度和可用长度的较小值 */
        copy_len = (len < available_len) ? len : available_len;
        if (copy_len == 0)
        {
            DRV_UART_LOGD("UART port %d no data available", port);
            return 0;
        }

        /* 拷贝数据（需要处理循环情况） */
        for (i = 0; i < copy_len; i++)
        {
            data[i] = ctrl->config.rx_buf[ctrl->rx_read_index];
            ctrl->rx_read_index++;

            if (ctrl->rx_read_index >= ctrl->config.rx_buf_size)
            {
                ctrl->rx_read_index = 0;
            }
        }

        read_len = copy_len;

        DRV_UART_LOGD("UART port %d read %d bytes from RX buffer", port, read_len);
    }

    return read_len;
}

/*********************************************************************
 * @brief   挂起UART端口（低功耗）
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口状态不允许挂起）
 * @note    唤醒串口仅关闭TX，普通串口彻底关闭硬件
 *********************************************************************/
int drv_uart_suspend(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查：只有活跃状态才能挂起 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];

    DRV_UART_LOGD("Suspend UART port %d, wakeup_capable=%d", port, ctrl->config.is_wakeup_capable);

