Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    /* 保存现场 */
    ctrl->context.baudrate = ctrl->config.baudrate;
    ctrl->context.stat = USART_STAT0(usart_base);
    ctrl->context.ctrl0 = USART_CTL0(usart_base);
    ctrl->context.ctrl1 = USART_CTL1(usart_base);
    ctrl->context.ctrl2 = USART_CTL2(usart_base);

    /* 差异化处理：唤醒串口 vs 普通串口 */
    if (ctrl->config.is_wakeup_capable == true)
    {
        /* 唤醒串口：仅关闭TX，保持RX和中断 */
        usart_transmit_config(usart_base, USART_TRANSMIT_DISABLE);

        DRV_UART_LOGI("UART port %d suspended (wakeup mode, TX only)", port);
    }
    else
    {
        /* 普通串口：彻底关闭硬件 */
        /* 关闭DMA */
        if (ctrl->config.use_dma_rx == true)
        {
            _drv_uart_disable_dma_rx(port);
        }

        /* 关闭中断 */
        _drv_uart_disable_interrupt(port);

        /* 关闭UART外设 */
        usart_disable(usart_base);

        DRV_UART_LOGI("UART port %d suspended (normal mode, hardware off)", port);
    }

    /* 更新状态 */
    ctrl->state = DRV_UART_STATE_SUSPENDED;

    return 0;
}

/*********************************************************************
 * @brief   恢复UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口状态不允许恢复）
 * @note    恢复挂起的UART端口到活跃状态
 *********************************************************************/
int drv_uart_resume(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查：只有挂起状态才能恢复 */
    if (ctrl->state != DRV_UART_STATE_SUSPENDED)
    {
        DRV_UART_LOGW("UART port %d not suspended, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];

    DRV_UART_LOGD("Resume UART port %d, wakeup_capable=%d", port, ctrl->config.is_wakeup_capable);

    /* 差异化恢复：唤醒串口 vs 普通串口 */
    if (ctrl->config.is_wakeup_capable == true)
    {
        /* 唤醒串口：仅恢复TX */
        usart_transmit_config(usart_base, USART_TRANSMIT_ENABLE);

        DRV_UART_LOGI("UART port %d resumed (wakeup mode, TX only)", port);
    }
    else
    {
        /* 普通串口：重新初始化硬件 */
        /* 使能UART外设 */
        usart_enable(usart_base);

        /* 使能中断 */
        _drv_uart_enable_interrupt(port);

        /* 如果启用DMA接收，重新启动 */
        if (ctrl->config.use_dma_rx == true)
        {
            _drv_uart_enable_dma_rx(port);
        }

        DRV_UART_LOGI("UART port %d resumed (normal mode, hardware on)", port);
    }

    /* 更新状态 */
    ctrl->state = DRV_UART_STATE_ACTIVE;

    return 0;
}

/*********************************************************************
 * @brief   关闭UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口未初始化）
 * @note    彻底关闭硬件，可通过resume恢复，不释放控制实例
 *********************************************************************/
int drv_uart_shutdown(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查：未初始化状态不能关闭 */
    if (ctrl->state == DRV_UART_STATE_UNINIT)
    {
        DRV_UART_LOGW("UART port %d not initialized", port);
        return DRV_UART_ERR_FAILED;
    }

    usart_base = s_usart_base[port];

    DRV_UART_LOGD("Shutdown UART port %d, current state=%d", port, ctrl->state);

    /* 关闭DMA */
    if (ctrl->config.use_dma_rx == true)
    {
        _drv_uart_disable_dma_rx(port);
    }

    /* 关闭中断 */
    _drv_uart_disable_interrupt(port);

    /* 关闭UART外设 */
    usart_disable(usart_base);

    /* 更新状态 */
    ctrl->state = DRV_UART_STATE_SHUTDOWN;

    DRV_UART_LOGI("UART port %d shutdown successfully", port);

    return 0;
}

/*********************************************************************
 * @brief   获取UART端口状态
 * @param   port    UART端口号
 * @return  UART状态枚举值，-1表示失败（端口无效）
 * @note    用于调试和问题排查
 *********************************************************************/
int drv_uart_get_state(drv_uart_port_e port)
{
    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    DRV_UART_LOGD("UART port %d state: %d", port, s_uart_ctrl[port].state);

    return (int)s_uart_ctrl[port].state;
}

/*********************************************************************
 * @brief   查询可读取的接收数据长度
 * @param   port    UART端口号
 * @return  可读取的字节数，-1表示失败（端口无效）
 * @note    应用层可通过此接口查询有多少数据待读取，避免无效调用uart_read
 *********************************************************************/
int drv_uart_get_rx_len(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl;
    uint16_t available_len = 0;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return DRV_UART_ERR_FAILED;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return DRV_UART_ERR_FAILED;
    }

    /* 判断是否启用RingBuffer */
    if (ctrl->config.use_ringbuf == true)
    {
        /* 从RingBuffer查询数据长度 */
        if (ctrl->config.ringbuf == NULL)
        {
            DRV_UART_LOGE("RingBuffer pointer is NULL for port %d", port);
            return DRV_UART_ERR_FAILED;
        }

        available_len = (uint16_t)my_rb_get_data_size(ctrl->config.ringbuf);
    }
    else
    {
        /* 从基础接收缓存计算可读取长度 */
        if (ctrl->rx_write_index >= ctrl->rx_read_index)
        {
            available_len = ctrl->rx_write_index - ctrl->rx_read_index;
        }
        else
        {
            available_len = ctrl->config.rx_buf_size - ctrl->rx_read_index + ctrl->rx_write_index;
        }
    }

