Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    DRV_UART_LOGD("UART port %d rx available: %d bytes", port, available_len);

    return (int)available_len;
}

/*********************************************************************
 * @brief   UART中断处理函数（统一入口）
 * @param   port    UART端口号
 * @return  无
 * @note    本函数由gd32f50x_it.c中的官方中断服务函数调用，例如：
 *          void USART0_IRQHandler(void) { uart_irq_handler(UART_PORT_USART0); }
 *          应用层不应直接调用此函数
 *          优化：直接读取寄存器，避免函数调用开销
 *********************************************************************/
void drv_uart_irq_handler(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    uint8_t data;
    uint16_t dma_len = 0;
    uint32_t stat0;
    uint32_t int0;
    uint32_t ringbuf_used_size;
    uint32_t ringbuf_threshold;
    uint16_t next_write_idx;
    drv_dma_channel_id_e dma_ch;
    uint32_t err_flags;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        return;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    /* 检查端口状态，非活跃状态不处理中断 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        return;
    }

    /* 一次性读取状态寄存器和中断使能寄存器（优化：避免多次函数调用） */
    stat0 = USART_STAT0(usart_base);
    int0 = USART_CTL0(usart_base);

    /* 1. 处理RXNE中断（接收数据非空） */
    if ((stat0 & USART_STAT0_RBNE) && (int0 & USART_CTL0_RBNEIE))
    {
        /* 读DR寄存器清除RBNE标志 */
        data = (uint8_t)USART_DATA(usart_base);

        /* 根据接收模式分发处理（switch优化） */
        switch (ctrl->rx_mode)
        {
            case DRV_UART_RX_MODE_NODMA_RINGBUF:
                /* 非DMA + RingBuffer模式 */
                my_rb_write(ctrl->config.ringbuf, &data, 1);

                /* 检查 RingBuffer 是否半满（触发应用层及时处理，仅触发一次） */
                if (ctrl->config.rx_callback != NULL && !ctrl->ringbuf_half_triggered)
                {
                    ringbuf_used_size = my_rb_get_data_size(ctrl->config.ringbuf);
                    ringbuf_threshold = ctrl->config.ringbuf->size / 2;  /* 半满阈值 */

                    if (ringbuf_used_size >= ringbuf_threshold)
                    {
                        ctrl->ringbuf_half_triggered = true;  /* 标记已触发，防止重复 */
                        ctrl->config.rx_callback(port, ringbuf_used_size);
                    }
                }
                break;

            case DRV_UART_RX_MODE_NODMA_RXBUF:
                /* 非DMA + rx_buf模式（循环缓冲区） */
            {
                /* 计算下一个写指针位置 */
                next_write_idx = (ctrl->rx_write_index + 1) % ctrl->config.rx_buf_size;

                /* 检查是否会覆盖未读数据 */
                if (next_write_idx == ctrl->rx_read_index)
                {
                    /* 缓冲区满，触发溢出错误 */
                    if (ctrl->config.error_callback != NULL)
                    {
                        ctrl->config.error_callback(port, DRV_UART_ERROR_OVERRUN);
                    }
                    /* 丢弃当前字节 */
                    break;
                }

                /* 写入数据 */
                ctrl->config.rx_buf[ctrl->rx_write_index] = data;
                ctrl->rx_write_index = next_write_idx;
                break;
            }

            default:
                /* DMA模式：不处理RXNE，由DMA自动搬运 */
                break;
        }
    }

    /* 2. 处理IDLE中断（空闲帧，一帧数据接收完成） */
    if ((ctrl->irq_enabled & DRV_UART_IRQ_IDLE) && (stat0 & USART_STAT0_IDLEF) && (int0 & USART_CTL0_IDLEIE))
    {
        /* 清除IDLE标志：读STAT0 + 读DATA（参考官方示例） */
        (void)usart_data_receive(usart_base);

        /* 如果启用DMA接收，计算DMA已接收的数据长度 */
        if (ctrl->config.use_dma_rx == true)
        {
            dma_ch = s_uart_rx_dma_ch[port];

            /* 增量拷贝：根据 dma_rx_last_pos 和当前 DMA 位置计算新数据，写入 RingBuffer */
            if (dma_ch < DRV_DMA_MAX)
            {
                _uart_dma_rx_copy_data(port);

                /* CIRCULAR 模式：DMA 不停止，仅读 RingBuffer 当前数据量作为回调参数 */
                if (ctrl->config.use_ringbuf == true && ctrl->config.ringbuf != NULL)
                {
                    dma_len = (uint16_t)my_rb_get_data_size(ctrl->config.ringbuf);
                }
            }
            else
            {
                dma_len = 0;  /* UART4无DMA */
            }
        }
        else
        {
            /* 非DMA模式：计算接收长度 */
            if (ctrl->config.use_ringbuf == true && ctrl->config.ringbuf != NULL)
            {
                /* RingBuffer模式：查询当前数据量 */
                dma_len = (uint16_t)my_rb_get_data_size(ctrl->config.ringbuf);
            }
            else
            {
                /* rx_buf模式：计算写指针与读指针的差值 */
                if (ctrl->rx_write_index >= ctrl->rx_read_index)
                {
                    dma_len = ctrl->rx_write_index - ctrl->rx_read_index;
                }
                else
                {
                    dma_len = ctrl->config.rx_buf_size - ctrl->rx_read_index + ctrl->rx_write_index;
                }
            }
        }

        /* 调用接收完成回调 */
        if (ctrl->config.rx_callback != NULL)
        {
            ctrl->config.rx_callback(port, dma_len);
        }
    }

    /* 3. 处理错误中断（仅 DMA 接收模式下 ERRIE 有效，覆盖 FERR/ORERR/NERR）
     * 注：PERR 由 CTL0 的 PERRIE 独立控制，不在 ERRIE 范围内。
     * 非 DMA 模式下错误标志通过 RBNE 中断连带报告。
     * 错误标志清除方式：读 STAT0 + 读 DATA。
     */
    if (ctrl->irq_enabled & DRV_UART_IRQ_ERR)
    {
        err_flags = stat0 & (USART_STAT0_FERR | USART_STAT0_ORERR |
                                       USART_STAT0_NERR);
        if (err_flags)
        {
            /* 读DATA清除所有错误标志（读STAT0已在ISR入口完成） */
            (void)usart_data_receive(usart_base);

            if (err_flags & USART_STAT0_FERR)
            {
                if (ctrl->config.error_callback != NULL)
                {
                    ctrl->config.error_callback(port, DRV_UART_ERROR_FRAME);
                }
            }

            if (err_flags & USART_STAT0_ORERR)
            {
                if (ctrl->config.error_callback != NULL)
                {
                    ctrl->config.error_callback(port, DRV_UART_ERROR_OVERRUN);
                }
            }

            if (err_flags & USART_STAT0_NERR)
            {
                if (ctrl->config.error_callback != NULL)
                {
                    ctrl->config.error_callback(port, DRV_UART_ERROR_NOISE);
                }
            }
        }
    }

    /* 4. 处理TXE中断（发送数据寄存器空） */
    if ((stat0 & USART_STAT0_TBE) && (int0 & USART_CTL0_TBEIE))
    {
        /* 调用TXE中断处理函数 */
        _uart_tx_irq_handler(port);
    }

    /* 5. 处理TC中断（发送完成） */
    if ((stat0 & USART_STAT0_TC) && (int0 & USART_CTL0_TCIE))
    {
        USART_STAT0(usart_base) = ~USART_STAT0_TC;  /* 写0清除TC */

        /* TODO: 发送完成回调 */
    }
}
